<!-- dflook/terraform-github-actions {"workspace":"pull-request-target-harden-cloud-2","backend_type":"remote","label":"test-cloud cloud save-plan-changes","backend":"f96cdea35d8dcb02b770e913a5760233d8ae94651e7bb87a8df8b321a3f7a1b9","plan_job_ref":"Job Test Terraform cloud #368 at https://github.com/dflook/terraform-github-actions/actions/runs/21525285355","plan_out_hash":"6cd041ffd76ea5849b3a3da42c75ccf3bcb1816eb7e8e1ba96f8e977ea2c2484","plan_hash":"dc3ab66114fdb997c1cb52d402b48ba9e8352d8dd140e2efebdf644beffde99c","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan for __test-cloud cloud save-plan-changes__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_id.the_id must be replaced
-/+ resource "random_id" "the_id" {
!~      b64_std     = "********" -> (known after apply)
!~      b64_url     = "*******" -> (known after apply)
!~      byte_length = 5 -> 8 # forces replacement
!~      dec         = "************" -> (known after apply)
!~      hex         = "**********" -> (known after apply)
!~      id          = "*******" -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!~  id  = "**********" -> (known after apply)
!~  len = 5 -> 8
```
</details>

:white_check_mark: Plan applied in [Test Terraform cloud #368](https://github.com/dflook/terraform-github-actions/actions/runs/21525285355)
<details open><summary>Outputs</summary>

```hcl
id  = "dc1de6571512d626"
len = 8
```
</details>